Repository: oscarahalvorsen/masterproject
Catalog: datacollecting/MAALFRID/tmx/kompetansenorge.no.csv-en-nn.deduped.tmx
Source language: en
Languages: nn

source: Training framework Training participants must achieve a minimum level of Norwegian language skills, see section 31 of the Integration Act. There is no longer a specific number of hours that need to be completed.
nn: Deltakarar i opplæringa skal oppnå eit minimumsnivå i norsk, jf. integreringslova § 31. Det er ikkje lenger eit visst antal timar som skal gjennomførast, men undervisning i eit omfang som gjer at deltakaren oppnår minimumsnivået.

source: Participants can express and respond to views and arguments and participate in interactions with a level of spontaneous and fluent language that enables communication among the parties involved to flow with ease.
nn: Deltakaren kan uttrykke og respondere på synspunkt og argument og delta i samhandlingssituasjonar med eit så spontant og flytande språk at kommunikasjonen ikkje blir anstrengande for nokon av partane.

source: Digital skills Using digital skills in Norwegian language training for adult immigrants means using digital resources to interact, find relevant information, create oral and written texts and develop and express one's own competence in a Norwegian-language context.
nn: Digitale ferdigheiter Å bruke digitale ferdigheiter i faget norsk for vaksne innvandrarar inneber å bruke digitale ressursar til å samhandle, finne relevant informasjon, skape munnlege og skriftlege tekstar og utvikle og uttrykke eigen kompetanse i ein norskspråkleg samanheng.

source: • recognise Norwegian phonemes and be able to match up phonemes and
nn: • kjenne att norske fonem og kunne knyte saman fonem og grafem

source: 2–4 weeks after taking the test
nn: 2–4 veker etter at du har teke prøven

source: five skills that form the basic prerequisites for learning and
nn: • bruke sosiale medium for halde seg oppdaterte og

source: sex, but Marit generally says she is tired and turns
nn: Hans viser ofte at han har lyst på sex, men Marit

source: Feedback is one of the factors that most greatly impacts on learning outcomes (Hattie 2008), but when research also shows that feedback that is not goal-oriented can yield a negative learning outcome (Black and Wiliam 1998), it is important to know what sort of feedback has a positive effect.
nn: Tilbakemeldingar er ein av dei faktorane som verkar sterkast på læringsresultatet (Hattie 2008), men når forsking også viser at lite målretta tilbakemeldingar kan gi negativ læringseffekt (Black og Wiliam 1998), er det viktig å vita kva slags tilbakemeldingar som har positiv effekt.

source: Competence aims for level B2 (independent user)
nn: Kompetansemål for nivå B2 (sjølvstendig brukar)

source: • Rape is a gross sexual assault.
nn: • Valdtekt er eit grovt seksuelt overgrep.

source: Norwegian language training for adult immigrants, together with social studies, is intended to prepare Norwegian immigrants for everyday life, education and working life to the greatest extent possible.
nn: Faget norsk for vaksne innvandrarar skal saman med faget samfunnskunnskap gjere vaksne innvandrarar best mogleg rusta for kvardagsliv, utdanning og arbeidsliv i Noreg.

source: • read and understand the main content in information exchanges, for
nn: • lese og forstå det viktigaste innhaldet i informasjonsutveksling, for eksempel

source: With buddy learning, the participants not only learn about the subject and communication, but they also learn to work together, listen to each other and help each other.
nn: I kameratlæring lærer deltakarane ikkje berre faget og det å kommunisera, men òg å samarbeida, lytta til kvarandre og hjelpa kvarandre.

source: • describe people, places and objects in very simple terms;
nn: • beskrive personar, stader og gjenstandar på ein svært enkel måte

source: or midwife early in their pregnancy.
nn: tidleg i svangerskapet.

source: In addition, the formative assessment will help participants reflect on their own learning and gain an understanding of the principles and values of the Norwegian school system.
nn: I tillegg skal undervegsvurderinga bidra til at deltakarane reflekterer over eiga læring og samtidig får ei forståing av prinsippa og verdiane i det norske skolesystemet.

source: • apply knowledge of data protection and copyright and of their own right and
nn: • bruke kunnskap om personvern og opphavsrett og retten ein sjølv og andre

source: • understand and apply concepts that are useful when learning to read and
nn: • forstå og bruke omgrep som er nyttige i lese- og skriveopplæringa

source: specific, everyday words from a very simple context or based on similarities with other languages they speak.
nn: konkrete, daglegdagse ord ut frå ein svært enkel kontekst eller med bakgrunn i likskapar med andre språk deltakaren snakkar

source: • When the mother and her child have returned home, the parents
nn: • Etter at mor og barn har komme heim, får foreldra og den nyfødde oppfølging frå

source: • take useful notes from a meeting, presentation or lecture in their own
nn: • ta formålstenlege notat frå eit møte, ein presentasjon eller forelesing innan

source: • Baptism and the Humanist naming ceremony are solemn celebrations marking
nn: • Barnedåp og humanistisk namnefest er høgtidlege seremoniar som markerer

source: The landlord is very positive and wants Lisa to look at the apartment at the
nn: Huseigaren er svært positiv og vil at Lisa skal komme og sjå på leilegheita så

source: • present themselves and their competence in an appropriate way, and give
nn: • presentere seg sjølv og sin eigen kompetanse på ein passande måte og

source: • discuss the core values of the Norwegian school and educational system,
nn: • samtale om sentrale verdiar som det norske skole- og utdanningssystemet

source: Accessibility and accommodation
nn: Tilrettelegging og tilgjenge

source: – there are two different tax classes, 1 and 2.
nn: – det er to ulike skatteklasser, klasse 1 og 2.

source: • describe people, places and activities in simple terms;
nn: • beskrive personar, stader og aktivitetar på ein enkel måte

source: At this level, language skills cross domains, in accordance with the descriptions in the CEFR and the CEFR Companion Volume.
nn: På dette nivået er språkferdigheitene domeneoverskridande i tråd med beskrivingane i Rammeverket og Tillegget til Rammeverket.

source: Participants who follow the Introduction Act in accordance with the transitional rules in the Integration Act section 51 and the Integration Regulations section 72 must also complete 50 hours of training in social studies.
nn: Deltakarar som følgjer introduksjonslova i samsvar med overgangsreglane i integreringslova § 51 og integreringsforskrifta § 72 skal òg gjennomføre 50 timar opplæring i samfunnskunnskap.

source: The lines are often blurred between listening and learning, for example when communication takes place in full or in part on digital platforms.
nn: Det vil ofte vere glidande overgangar mellom lytting og lesing, for eksempel når kommunikasjonen skjer heilt eller delvis på digitale flater.

source: • skim long and complex texts and assess the relevance of the content;
nn: • skumlese lange og komplekse tekstar og vurdere relevansen av innhaldet

source: At level A2, participants can understand clear, simple language and can express themselves in simple terms in relation to familiar topics related to themselves and their surroundings, their learning and work situations, and society.
nn: På nivå A2 kan deltakaren forstå klart, enkelt språk og uttrykke seg enkelt om kjende emne knytte til eigen person, nære omgivnader, opplæring og arbeids- og samfunnsliv.

source: – The prevention and treatment of sexually
nn: – førebygging og behandling av seksuelt

source: that she is too Norwegian in her ways and goes to bed.
nn: Ho seier at Memona er altfor norsk i tankane sine, og går til

source: • follow clear and structured presentations on familiar topics, e.g.
nn: • følge med i klare og strukturerte framstillingar om kjende emne, for

source: • read descriptions and instructions related to the work
nn: • delta i intern og ekstern opplæring, for eksempel kurs om

source: • Copying all or parts of a text that is not your own (for example
nn: • å lime inn tekst i på skriveprøven (dette blir automatisk

source: Trying things out and discussing issues in a small, safe learning group creates less stress and fear of taking part, and greater safety and participation.
nn: Utprøving og problematisering i ei lita og trygg læringsgruppe skapar mindre stress og redsle for å delta, og større tryggleik og deltaking.

source: • employ a variety of listening strategies to achieve understanding, including
nn: • bruke ei rekke lyttestrategiar for å klare å forstå, mellom anna prøve å få

source: No, the Diploma Registry is not the same as Min side.
nn: Vitnemålsportalen er ikkje det same som Min side.

source: For some people, this means gaining Norwegian language skills that allow them to utilise their inherent basic skills in Norwegian-language contexts, while others will need adaptation and systematic work in order to develop basic skills throughout the training.
nn: For nokre av dei vil dette innebere å få norskferdigheiter til å kunne gjere seg nytte av dei grunnleggande ferdigheitene dei har med seg, i norskspråklege samanhengar, medan andre vil ha behov for tilrettelegging og systematisk arbeid med å utvikle grunnleggande ferdigheiter gjennom heile opplæringa.

source: For most of them, this language will be written and spoken Norwegian, but for some it will be Norwegian sign language instead of spoken Norwegian.
nn: For dei fleste vil dette språket vere norsk munnleg og skriftleg, men for enkelte kan det vere norsk teiknspråk i staden for norsk munnleg.

source: • offer and respond to invitations, suggestions, congratulations and apologies,
nn: • komme med og svare på invitasjonar, forslag, gratulasjonar og

source: congratulations, and write and comment on posts in digital communication in simple terms;
nn: og skrive og kommentere innlegg i digital kommunikasjon på ein enkel måte

source: Their intention is to improve their skills.
nn: Dei som har meistringsmål, legg vekt på meistring og læring.

source: They must be able to compare Norwegian with other languages they know, use knowledge about language as a system and apply cultural understanding to how language is used in different contexts.
nn: Dei skal kunne samanlikne norsk med andre språk dei kan, bruke kunnskapar om språket som system og ha ei kulturell forståing for korleis språk blir brukt i ulike samanhengar.

source: • write and respond to very simple routine messages;
nn: • skrive og svare på svært enkle, rutinemessige meldingar

source: • understand numbers and expressions for quantities, prices and times;
nn: • forstå tal og uttrykk for mengde, prisar og opplysning om tid

source: • Freedom of religion and belief are key values.
nn: • Religions- og trusfridom er viktige verdiar.

source: Lisa and Anna go to look at the apartment together.
nn: Lisa og Anna går saman for å sjå på leilegheita.

source: You must return your notes before you leave the premises.
nn: Papiret må du levere før du forlèt lokalet.

source: Participants’ previous schooling, experience with written texts and other languages they have learned may have a great impact on deciding which work methods and Norwegian language goals are relevant.
nn: Tidlegare skolegang, erfaring med skrift, og andre språk dei har lært, kan ha mykje å seie for kva arbeidsmåtar og norskmål som er relevante for deltakarane.

source: • give examples of important laws, rules and values regarding the rights of
nn: • gi eksempel på viktige lover, reglar og verdiar som handlar om barn og

source: • recognise familiar symbols and words in very simple, authentic texts in
nn: • kjenne att nokre kjende symbol og ord i svært enkle, autentiske tekstar i

source: Is it the same as Min side?
nn: Er dette det same som Min side?

source: Language learning strategies The language learning strategies element covers the use of varied strategies to learn and practise language in different contexts and in a lifelong perspective.
nn: Kjerneelementet språklæringsstrategiar handlar om å bruke varierte strategiar for å lære og prøve ut språk i ulike samanhengar og i eit livslangt perspektiv.

source: • employ simple reading strategies to read and understand words and short
nn: • bruke nokre enkle lesestrategiar for å lese og forstå ord og korte tekstar

source: and different events, such as migration;
nn: ulike hendingar, som for eksempel migrasjon

source: • ask and answer very simple, direct questions about personal matters and
nn: • stille og svare på svært enkle, direkte spørsmål om personlege forhold og

source: • convey the content of images and simple spoken information;
nn: • formidle vidare innhaldet i bilete og enkel munnleg informasjon

source: • Women who have undergone genital mutilation
nn: • Kvinner som er kjønnslemlesta, kan få

source: Linguistic interaction occurs, inter alia, in conversations, email correspondence and chats, and may involve different linguistic acts, like information exchange and discussion.
nn: Språkleg samhandling skjer mellom anna i samtalar, e-postutveksling og chat, og kan involvere ulike språkhandlingar som for eksempel informasjonsutveksling og diskusjon.

source: Have I learned it?
nn: Har eg lært det?

source: Learners should reflect on feedback and consequences, and use error analysis effectively together with their teacher.
nn: Dei lærande bør reflektera over tilbakemeldingar og konsekvensar og bruka feilanalyse effektivt saman med læraren.

source: • make a very simple comment on social media posts using symbols, single
nn: • kommentere på ein svært enkel måte innlegg på sosiale medium ved hjelp

source: The ban also applies to public transport.
nn: Forbodet gjeld også for offentleg transport.

source: • Using electronic aids, for example mobile telephone, smart
nn: • å ha mobiltelefon eller andre elektroniske hjelpemiddel på

source: • read and understand very simple sentences and texts, supported by the
nn: • lese og forstå svært enkle setningar og tekstar med støtte i kontekst og der

source: • read and understand very simple fiction texts;
nn: • lese og forstå svært enkle skjønnlitterære tekstar

source: The letter will set out the date, time and location of the test.
nn: I brevet får du vite dato, klokkeslett og staden du skal møte til prøven.

source: • recognise and adopt the Norwegian reading and writing system;
nn: • kjenne til og bruke den norske lese- og skriveretninga

source: • report discrepancies and incidents
nn: • lese lister over ulike arbeidsoppgåver

source: They can have great expectations for their own language learning.
nn: Dei kan ha store forventningar til eiga språklæring.

source: This means that sexual relations with children and young people aged under 16 is a criminal offence.
nn: Det vil seie at seksuell omgang med barn og unge under 16 år er straffbart.

source: • understand very simple information on familiar topics from auditory and
nn: • oppfatte svært enkel informasjon om kjende emne frå auditivt og

source: The duration of the training for the different groups is stipulated in section 32 of the Integration Act.
nn: Varigheita av opplæringa for dei ulike gruppene er fastsett i integreringslova § 32.

source: • employ simple strategies to initiate, maintain and conclude a short
nn: • bruke enkle strategiar for å innleie, oppretthalde og avslutte ein kort

source: • employ different writing strategies, for example to highlight the most
nn: • bruke ulike skrivestrategiar, for eksempel for å framheve det ein meiner er

source: Having to learn a new language as an adult is a challenge for most people.
nn: Å måtta læra eit nytt språk i vaksen alder er ei utfordring for dei fleste.

source: • read excerpts from laws and regulatory agreements
nn: • lese informasjon om passasjerar og bestillingar

source: • Female genital mutilation performed
nn: • Kjønnslemlesting som er utført i

source: • employ a number of reading strategies to gain understanding, including
nn: • bruke ei rekke lesestrategiar for å klare å forstå, mellom anna prøve å få tak

source: • Enticing someone into travel ing out of Norway and entering into a forced
nn: • Å lokke nokon til å reise ut av landet for å arrangere

source: The two tests in Test in Norwegian C1 – higher academic level may be on two different dates, but they may also be on the same day.
nn: Dei to delprøvane på Norskprøven C1 – høgare akademisk nivå kan vere på to forskjellige datoar, men dei kan òg vere på same dag.

source: How can I learn it?
nn: Korleis kan eg læra det?

source: Authentic and meaningful participation are particularly important to adults.
nn: Autentisk og meiningsfull deltaking er særleg viktig for vaksne.

source: • Violence and coercion form part of the assault.
nn: • Vald og truslar er ein del av overgrepet.

source: The training must be adapted to participants’ own capacity for learning and needs, in addition to the demands and challenges they face in their surroundings.
nn: Opplæringa må tilpassast dei føresetnadene og behova deltakarane har, i tillegg til krav og utfordringar dei møter i omgivnadene sine.

source: messages and instructions, and times and directions;
nn: beskjedar, instruksjonar og tilvisingar til tid og stad

source: • read and understand very simple sentences in short, simple notifications and
nn: • lese og forstå svært enkle setningar i korte, enkle meldingar og beskjedar

source: • Prostitution means the purchase and sale of
nn: • Prostitusjon er kjøp og sal av seksuelle

source: • Talk about the situation described above.
nn: • Snakk om situasjonen over.

source: argue all the time, both about housework and about
nn: barn og er trøytte og slitne fordi det blir for lite søvn.

source: Participants’ Norwegian language goals must be at the minimum level stipulated or higher, but they can be adjusted according to their progress, according to section 27 of the Integration Regulations.
nn: Norskmålet til deltakaren skal tilsvare det rettleiande minimumsnivået eller høgare, men kan justerast opp eller ned ut frå progresjonen til deltakaren, jf. integreringsforskrifta § 27.

source: • convey simple, specific information from, for example, clear unambiguous
nn: • formidle vidare enkel, konkret informasjon frå for eksempel klare, tydelege

source: This MAPPING OF PARTICIPANTS AND ORGANISATION OF THE TRAINING | 4 | KAP 2 competence is best developed by helping participants to reflect on and systemise their experiences with the language within and outside the training, and to develop and test a range of strategies for using and learning Norwegian in these contexts.
nn: Denne kompetansen blir utvikla best gjennom at deltakarane får hjelp til å reflektere over og systematisere erfaringar dei gjer seg med språket i og utanfor opplæringa, og at dei får utvikle og prøve ut eit spekter av strategiar for å KARTLEGGING OG ORGANISERING AV OPPLÆRINGA | 4 | KAP 2 bruke og lære norsk i desse samanhengane.

source: Participants give each other direct and immediate feedback, argue, reflect and refresh their knowledge while discussing issues and in conversation with each other.
nn: Deltakarane gir kvarandre direkte og umiddelbar feedback, argumenterer, reflekterer og repeterer i problemløysing og i samtalar med kvarandre.

source: Pursuant to section 27 of the Integration Regulations, the Norwegian language goal of a participant must be equal to the recommended minimum level or higher, but the Norwegian language goal can be adjusted either up or down, based on their progress.
nn: I tråd med § 27 i integreringsforskrifta skal norskmålet til deltakaren tilsvare det rettleiande minimumsnivået eller høgare, men norskmålet kan justerast opp eller ned ut frå progresjonen til deltakarane.

source: • use computerized learning resources for training
nn: • sjekke budsjett og kome med innspel til arbeidsoppgåver

source: What consequences could Andreas’ behaviour have for his wife and for Andreas himself?
nn: Kva konsekvensar kan åtferda til Andreas få for både kona og Andreas sjølv?

source: • collaborate on tasks by inviting others to participate, providing input, asking
nn: • samarbeide om oppgåver ved å invitere andre til å delta, bidra med innspel,

source: • Is this discrimination?
nn: • Er dette diskriminering?

source: • In very serious cases, for example in the case of violence and abuse, the child
nn: • I svært alvorlege saker, der det for eksempel førekjem vald og mishandling, kan

source: The linguistic acts may come from concrete and everyday situations at levels A1 and A2.
nn: Språkhandlingane kan vere henta frå konkrete og daglegdagse situasjonar på nivå A1 og A2.

source: It is also crucial that it is meaningful.
nn: Dessutan er det avgjerande at det er meiningsfullt.

source: • collaborate on solving problems by discussing different alternatives,
nn: • samarbeide om å løyse oppgåver ved å diskutere ulike alternativ,

source: • apply knowledge about how people socialise in Norwegian society and how
nn: • bruke kunnskap om omgangsformer i det norske samfunnet og om korleis

source: As level C1 language users can navigate most situations successfully in terms of language, the limitations are linked to disciplines rather than contexts.
nn: Ettersom språkbrukaren på nivå C1 klarer seg språkleg godt i dei aller fleste situasjonar, vil eventuelle feil eller manglar snarare vere knytte til fagområde enn til kontekstar.

source: • write and respond to very simple messages about specific, familiar topics
nn: • skrive og svare på svært enkle meldingar om konkrete, kjende emne og

source: and guidance throughout the whole of their pregnancy.
nn: råd og rettleiing gjennom heile graviditeten.

source: The reading and writing work must be based on contexts, topics and language that convey meaning and are comprehensible to participants.
nn: Arbeidet med lesing og skriving må ta utgangspunkt i samanhengar, tema og språk som gir meining og er forståelege for deltakarane.

source: person or a rape in a close relationship
nn: er bevisstlaus, og valdtekt i nære

source: marriage is punishable in the same way.
nn: tvangsekteskap blir straffa på same måte.

source: The lines are often blurred between oral and written texts, for example when communication takes place in full or in part on digital platforms.
nn: Det vil ofte vere glidande overgangar mellom munnleg og skriftleg tekst, for eksempel når kommunikasjonen skjer heilt eller delvis på digitale flater.

source: The mapping of participants should also clarify their short and long-term goals for learning Norwegian, their work experience, their digital skills and their health and life circumstances, including sight and hearing.
nn: Kartlegginga bør også få fram kva mål deltakarane har med å lære norsk på kort og lang sikt, kva for arbeidserfaring og digitale ferdigheiter dei har, og helse- og livssituasjonen deira, deriblant syn og høyrsel.

source: Listening and understanding are practised by receiving input from varied sources, but also by having to answer questions and communicate with others.
nn: Å lytta og å forstå trenar ein ved å få innputt frå varierte kjelder, men òg ved å måtta svara på spørsmål og kommunisera med andre.

source: If you are on sick leave, this is regarded as authorised absence, and you can take the test later.
nn: Dersom du har sjukmelding, blir det rekna som gyldig fråvær, og du kan ta prøven seinare.

source: Independent learning is meaningful learning.
nn: Sjølvstyrt læring er meiningsfull læring.

source: See section 73 of the Integration Regulations for more detailed transitional rules.
nn: Sjå integreringsforskrifta § 73 for nærare overgangsreglar.

source: Lisa wakes Ole
nn: Lisa vekker Ole og spør kva
